// First Assignment

Array.isArray();
// فنكشن جاهزة بستقبل متغير بين الاقواس وبتشيك
//  اذنو اراي او لأ وبترجع قيمة بوليان ترو او فولس

Array.from();
// فنكشن جاهز بستقبل اراي او اوبجكت او سترنج وبعمل منو اراي وبرجع الاراي الجديدة

Array.length();
// فنكشن جاهز بستقبل اراي وبرجعلي طولها

Array.call();
// بنستخمها لما بدنا نستعمل اراي ميثود على اشي مش اراي زي
//  اوبجكت بس بشبه الاراي مثلا لو بدنا نستعمل سلايس على اوبجكت

Array.bind();
// بنستخدمها لما بدنا نربط اراي فنكشن مثل سلايس مثلا مع اوبجكت
//  او اراي ثانية بتشبه الكول بس هون بترجعلي فنكشن جديد

/*............................................................................*/
